import type { Rule_ID } from '../types/Rule'

export const RuleText: Record<Rule_ID, string> = {
  '[Sudoku]': '[Sudoku] 스도쿠: 보드판의 모든 칸에 1~9 숫자를 채워야 합니다.',
  '[R]': '[R] 가로열: 보드판의 가로줄에는 같은 숫자가 중복할 수 없습니다.',
  '[C]': '[C] 세로열: 보드판의 세로줄에는 같은 숫자가 중복할 수 없습니다.',
  '[B]': '[B] 박스: 보드판에서 굵은 실선으로 구분된 박스 내부에는 같은 숫자가 중복할 수 없습니다.',
  '[SG]': '[SG] 세그먼트: 굵은 실선으로 구분된 세그먼트 내에는 같은 숫자가 중복할 수 없습니다.',
  "[SG']": "[SG'] 세그먼트': 같은 색상으로 구분된 세그먼트 내에는 같은 숫자가 중복할 수 없습니다.",
  '[DT]': '[DT] 디스턴트: 가로 / 세로 / 대각선으로 인접한 칸에 같은 숫자가 중복할 수 없습니다.',
  '[LK]': '[LK] 링크: 마름모 모양으로 연결된 두 칸의 숫자는 반드시 1 차이 나야 합니다.',
  "[LK']": "[LK'] 링크': 마름모 모양으로 연결된 두 칸의 숫자는 반드시 1 차이 나야 합니다. 가능한 모든 마름모가 주어집니다.",
  '[MT]': '[MT] 메타: 다이아몬드 기호가 그려진 칸들 중 숫자 X가 있다면, 그 기호 위의 모든 칸들 중 X는 정확히 X개 존재합니다.',
  '[MR]': '[MR] 메트로: 색선으로 표시된 노선 위의 모든 숫자는 순서에 상관없이 중복없는 연속된 숫자들로 이루어져야 합니다.',
  '[QD]': '[QD] 쿼드: 어떤 2×2 영역을 잡아도, 4개의 숫자 중 홀수와 짝수가 각각 하나 이상 존재합니다.',
  "[QD']": "[QD'] 쿼드': 어떤 2×2 영역을 잡아도, 4개 숫자의 합이 3의 배수가 아닙니다.",
  '[TP]': '[TP] 트리플렛: 대각선 방향으로 연속한 세 칸의 숫자는 증가하거나 감소하는 순서로 나열될 수 없습니다.',
  '[LO]': '[LO] 로터스: 동그라미 표시 된 칸은 상하좌우로 인접한 칸의 숫자들 모두보다 값이 크거나 모두보다 작습니다.',
  "[LO']": "[LO'] 로터스': 동그라미 표시 된 칸은 상하좌우로 인접한 칸의 숫자들의 산술평균과 같습니다. (소숫점 버림)",
  '[BP]': "[BP] 범퍼: 상하좌우로 인접한 모든 칸과 값이 3 이상 차이나는 칸을 '범퍼'라고 합니다. 각 행과 열에는 정확히 한 개의 '범퍼'가 존재합니다.",
  '[PO]': '[PO] 포인트: 삼각형 모양으로 연결된 두 칸에서, 삼각형이 가리키는 쪽이 아닌 쪽보다 숫자가 커야 합니다.',
  "[R']": "[R'] 가로열': 각 가로열에는 정확히 여덟 가지의 숫자가 등장해야 합니다. 등장하지 않는 한 가지 숫자는 모든 가로열에서 서로 다릅니다.",
  '[PR]':
    '[PR] 프리즘: 빨간 육각형 사이의 두 숫자를 두 자리 수로 읽으면 소수이고, 파란 육각형 사이의 두 숫자를 두 자리 수로 읽으면 제곱수입니다. 가로는 왼쪽이 십의 자리, 세로는 위가 십의 자리입니다.',
  "[PR']":
    "[PR']: 빨간 육각형 두 개를 사이에 둔 세 숫자를 세 자리 수로 읽으면 소수이고, 파란 육각형 두 개를 사이에 둔 세 숫자를 세 자리 수로 읽으면 제곱수입니다. 가로는 왼쪽부터, 세로는 위쪽부터 읽습니다.",
  '[RT]': '[RT] 루트: 회색 숫자가 표시된 칸에서 가장 가까운 같은 숫자까지의 거리는 표시된 값과 같습니다.',
  "[RT']": "[RT'] 루트': 회색 숫자가 표시된 칸에서 가장 먼 같은 숫자까지의 거리는 표시된 값과 같습니다.",
  '[PA]': '[PA] 페어: 점선 테두리로 표시된 2칸 영역들 중 어느 두 개도 포함된 두 숫자의 쌍이 같을 수 없습니다.',
  '[VT]': '[VT] 벡터: 삼각형이 표시된 칸의 숫자를 X이라 하면, 그 칸에서 삼각형이 가리키는 방향으로 X칸 이동한 위치에 9가 있습니다.',
  '[EF]': '[EF] 리플렉스: 노란색 동그라미 표시된 칸 주변 3×3에서 자신보다 숫자가 낮거나 같은 표시된 칸이 X개 있으면, 그 칸의 숫자는 X입니다.',
  '[TM]': '[TM] 템퍼러쳐: 파란 영역 내 세 숫자의 합은 10 이하, 초록 영역은 합이 정확히 15, 빨간 영역의 합은 20 이상입니다.',
}
