import type { Rule_ID } from '../types/Rule'

export const RuleText: Record<Rule_ID, string> = {
  '[Sudoku]': '[Sudoku] 스도쿠: 보드판의 모든 칸에 1~9 숫자를 채워야 합니다.',
  '[R]': '[R] 가로열: 보드판의 가로줄에는 같은 숫자가 중복할 수 없습니다.',
  '[C]': '[C] 세로열: 보드판의 세로줄에는 같은 숫자가 중복할 수 없습니다.',
  '[B]': '[B] 박스: 보드판에서 굵은 실선으로 구분된 박스 내부에는 같은 숫자가 중복할 수 없습니다.',
  '[SG]': '[SG] 세그먼트: 굵은 실선으로 구분된 세그먼트 내에는 같은 숫자가 중복할 수 없습니다.',
  '[DT]': '[DT] 디스턴트: 가로 / 세로 / 대각선으로 인접한 칸에 같은 숫자가 중복할 수 없습니다.',
  '[LK]': '[LK] 링크: 마름모 모양으로 연결된 두 칸의 숫자는 반드시 1 차이 나야 합니다.',
  "[LK']": "[LK'] 링크': 마름모 모양으로 연결된 두 칸의 숫자는 반드시 1 차이 나야 합니다. 가능한 모든 마름모가 주어집니다.",
  '[MT]': '[MT] 메타: 다이아몬드 기호가 그려진 칸들 중 숫자 X가 있다면, 그 기호 위의 모든 칸들 중 X는 정확히 X개 존재합니다.',
  '[MR]': '[MR] 메트로: 색선으로 표시된 노선 위의 모든 숫자는 순서에 상관없이 중복없는 연속된 숫자들로 이루어져야 합니다.',
  '[QD]': '[QD] 쿼드: 어떤 2×2 영역을 잡아도, 4개의 숫자 중 홀수와 짝수가 각각 하나 이상 존재합니다.',
  '[TP]': '[TP] 트리플렛: 대각선 방향으로 연속한 세 칸의 숫자는 증가하거나 감소하는 순서로 나열될 수 없습니다.',
  '[LO]': '[LO] 로터스: 동그라미 표시 된 칸은 상하좌우로 인접한 칸의 숫자들 모두보다 값이 크거나 모두보다 작습니다.',
  "[LO']": "[LO'] 로터스': 동그라미 표시 된 칸은 상하좌우로 인접한 칸의 숫자들의 산술평균과 같습니다. (소숫점 버림)",
}
